<a href="https://colab.research.google.com/github/naveen63hdh/Data-Analytics/blob/main/Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1.Creating Dataframe in Python


> In python there are more than ways to create a dataframe using pandas. We can create dataframe from lists, tuple, dictionary, numpy array, csv file and etc. We can also create an empty dataframe and add records to it.

> To create a dataframe we are loading pandas library in the alias pd, and we are also loading numpy in alias np to create dataframe from numpy array.

In [1]:
import numpy as np
import pandas as pd

## 1.1 Creating empty dataframe and adding records


> DataFrame constructor is used to create a empty dataframe. The columns attribute is a list of strings which become columns of the dataframe. DataFrame rows are reference loc method with index value.

In [2]:
df = pd.DataFrame(columns = ["Emp No","Emp Name","Salary"])

In [3]:
df.loc[0] = [101,"Jai",14000]
df.loc[1] = [102,"Kannan",10000]
df.loc[2] = [103,"Raman",7000]
df.loc[3] = [104,"Suresh",9000]
df.loc[4] = [105,"Sam",11000]

In [4]:
df

  Emp No Emp Name Salary
0    101      Jai  14000
1    102   Kannan  10000
2    103    Raman   7000
3    104   Suresh   9000
4    105      Sam  11000

## 1.2 Creating dataframe using numpy array

> In DataFrame constructor we can pass numpy array. Each row in  numpy array is the corresponding row required in the dataframe.

In [5]:
data = np.array([[101,"Jai",14000],
                 [102,"Kannan",10000],
                 [103,"Raman",7000],
                 [104,"Suresh",9000],
                 [105,"Sam",11000]
                ])

In [6]:
type(data)

numpy.ndarray

In [7]:
df = pd.DataFrame(data,columns = ["Emp No","Emp Name","Salary"])

In [8]:
df

  Emp No Emp Name Salary
0    101      Jai  14000
1    102   Kannan  10000
2    103    Raman   7000
3    104   Suresh   9000
4    105      Sam  11000

## 1.3 Creating dataframe using List

>  To Create a dataframe using list we have to pass the list in DataFrame constructor and we can give column names in colum attribute.

In [9]:
data = [[101,"Jai",14000],
        [102,"Kannan",10000],
        [103,"Raman",7000],
        [104,"Suresh",9000],
        [105,"Sam",11000]]

In [10]:
type(data)

list

In [11]:
df = pd.DataFrame(data,columns = ["Emp No","Emp Name","Salary"])

In [12]:
df

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

## 1.4 Creating dataframe using Dictionary 

> There are 3 ways to create a dataframe using dictonary 

* [Using Dictionary in DataFrame Constructor](https://colab.research.google.com/drive/1XbRrMi3RkTKGM0l4m1qsXH5LRggqSzrj#scrollTo=BlQdFRMOOwp3)
* [Using List of Dictionary](https://colab.research.google.com/drive/1XbRrMi3RkTKGM0l4m1qsXH5LRggqSzrj#scrollTo=_L6MDM4LOwp1&line=7&uniqifier=1)
* [Using from_dict method](https://colab.research.google.com/drive/1XbRrMi3RkTKGM0l4m1qsXH5LRggqSzrj#scrollTo=_L6MDM4LOwp1&line=7&uniqifier=1)

### 1.4.1 Using Dictionary in DataFrame Constructor


> If we pass dictionary in dataframe then dictionary keys become column names of dataframe and dictionary value becomes dataframe row values. Dictionary column are combined into single row according to the order of dictionary.

In [13]:
data = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]}

In [14]:
type(data)

dict

In [15]:
df = pd.DataFrame(data)

In [16]:
df

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

### 1.4.2 Using List of Dictionary

> We can pass a list of dictionaries in DataFrame constructor. Each dictionary is considered as a record. Dictionary Keys become Column names in the dataframe. Dictionary values become the row values.

In [17]:
data = [{"Emp No":101,"Emp Name":"Jai","Salary":14000},
        {"Emp No":102,"Emp Name":"Kannan","Salary":10000},
        {"Emp No":103,"Emp Name":"Raman","Salary":7000},
        {"Emp No":104,"Emp Name":"Suresh","Salary":9000},
        {"Emp No":105,"Emp Name":"Sam","Salary":11000}]

In [18]:
type(data)

list

In [19]:
df = pd.DataFrame(data)

In [20]:
df

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

###  1.4.3 Using from_dict method

> Using **from_dict** is similar to first method except here we can specify whether the keys value should be a column  name or row index. 

> By default keys are identified as column names but we can change it by using **orient** attribute if  we give **index** to orient attribute it will change orientation of dataframe and passes the keys as row index. 

> If we  give orient as index then we can specify column name using columns attribute where we pass column name as list.

In [21]:
data = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]}

In [22]:
type(data)

dict

In [23]:
df = pd.DataFrame().from_dict(data,orient="index",columns=['Emp1','Emp2','Emp3','Emp4','Emp5'])

In [24]:
df

           Emp1    Emp2   Emp3    Emp4   Emp5
Emp No      101     102    103     104    105
Emp Name    Jai  Kannan  Raman  Suresh    Sam
Salary    14000   10000   7000    9000  11000

## 1.5 Creating copy of dataframe

> In some scenarios me might need to do operations in dataframe without affecting the actual dataframe. In those situations we can use copy method and create a clone of the dataframe and work on it.

In [25]:
df1 = df.copy()

In [26]:
df1

           Emp1    Emp2   Emp3    Emp4   Emp5
Emp No      101     102    103     104    105
Emp Name    Jai  Kannan  Raman  Suresh    Sam
Salary    14000   10000   7000    9000  11000

# 2. Creating DataFrame from CSV and Saving it to CSV

> CSV(Comma Seperated Values) is the most commonly used format used for storing tabular data like spreadsheets and database. As name suggests in csv values are seperated or delimited by comma ( , )

> Pandas Provide methods for creating dataframe from a csv file and to export/save a dataframe into a csv file.


## 2.1 Creating DataFrame from CSV

> To create dataframe from csv pandas library provides a method called read_csv. read_csv method contains many attributes some of the most commonly used attributes are.


1.   **filepath_or_buffer** - URL/Dir location of the csv file goes here
2.   **sep** - Delimeter of csv file. Default value is ','
3.   **header** - Makes the passed row or rowas as column header
4.   **index_col** - Makes passed column as index
5.   **use_cols** - Used to retrive only specific columns

In [27]:
df_path = 'https://raw.githubusercontent.com/naveen63hdh/Data-Analytics/main/dataset.csv'

In [28]:
one_piece_df = pd.read_csv(df_path,sep = ',', header = 'infer', index_col = 'Character', usecols = ['Character','Devil Fruit','Class','Status'])

In [29]:
one_piece_df.head()

                       Devil Fruit      Class       Status
Character
Marshall D. Teach  Gura Gura no Mi  Paramecia     Consumed
Marshall D. Teach  Yami Yami no Mi      Logia     Consumed
Absalom            Suke Suke no Mi  Paramecia  Re-Consumed
Alpacaman             Alpaca SMILE      SMILE     Consumed
Alvida             Sube Sube no Mi  Paramecia     Consumed

## 2.2 Saving DataFrame as CSV
> To save a dataframe as a csv file pandas provide a method called to_csv()

In [33]:
data = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]}

In [34]:
df = pd.DataFrame(data)

In [35]:
df.to_csv('my_dataset.csv')

# 3. Group by operations in DataFrame